RIET/src/Documents/СчетФактураАктУпр/СчетФактураАктУпр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураАктУпр</name>
  <registerRecords>AccumulationRegister.НДСПокупкиУпр</registerRecords>
  <registerRecords>AccumulationRegister.СчетаФактурыКонтрагентов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.АктыКонтрагентов</registerRecords>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДУМАТЬДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CashCode</name>
    <type>
      <types>CatalogRef.CashCode</types>
    </type>
  </attributes>
  <attributes>
    <name>Ваучер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗатрат</name>
    <type>
      <types>CatalogRef.ОписаниеЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>БухСчетLawson</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>БухСчет1C</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>AU1C</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>AULawson</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящейСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящейСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСФСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаСФ</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСФСНДСРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСФСНДСUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДССФ</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСФБезНДСРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДССФРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрихода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АРХИВСуммаПрихода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АРХИВВалютаПрихода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>АРХИВСуммаПриходаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АРХИВПричина</name>
    <comment>Причина рекласса</comment>
    <type>
      <types>CatalogRef.ПричиныНДСОтложенного</types>
    </type>
  </attributes>
  <attributes>
    <name>АРХИВТекущийAU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>АРХИВДатаРегистрацииСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АРХИВДатаРегистрацииПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АРХИВПроверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CashCodeКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизацииКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетLawson</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>AktOfAcceptance</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КраткоеНаименованиеНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеНаименованиеНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаUSD</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PO</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>POCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиPO</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Account</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SubAcct</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/ВзаиморасчетыСПоставщиками/ВзаиморасчетыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CashCode</name>
    <type>
      <types>CatalogRef.CashCode</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/НДСПокупкиУпр/НДСПокупкиУпр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НДСПокупкиУпр</name>
  <comment>(Регл) НДС, предъявляемый к вычету</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДСВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерВаучера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БухСчет1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.СобытияПоНДСПокупки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CashCode</name>
    <type>
      <types>CatalogRef.CashCode</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>БухСчет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/СчетФактураАктУпр/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мУдалятьДвижения;


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ, ОБЕСПЕЧИВАЮЩИЕ ПРОВЕДЕНИЕ ДОКУМЕНТА

Функция СформироватьТаблицуСостав()
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура"			, "Номенклатура");
	// ЧТО ЗДЕСЬ ЕЩЕ ДОЛЖНО БЫТЬ???
		
	РезультатЗапросаПоСоставу = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Состав", СтруктураПолей);
	Возврат РезультатЗапросаПоСоставу.Выгрузить();
	
КонецФункции

Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
		
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("ДатаПроведения");
	СтруктураОбязательныхПолей.Вставить("НалоговыйПериод");	
	
	// СДЕЛАТЬ ОБЯЗАТЕЛЬНЫМИ!!!
	//СтруктураОбязательныхПолей.Вставить("AU1C");
	//СтруктураОбязательныхПолей.Вставить("БухСчет1C");
	
	СтруктураОбязательныхПолей.Вставить("ДатаВходящейСФ");
	СтруктураОбязательныхПолей.Вставить("СуммаСФСНДС");
	СтруктураОбязательныхПолей.Вставить("ВалютаСФ");
	СтруктураОбязательныхПолей.Вставить("СуммаСФСНДСРуб");
	СтруктураОбязательныхПолей.Вставить("СуммаСФБезНДСРуб");
	
	СтруктураОбязательныхПолей.Вставить("ДатаПрихода");
		
	// Теперь позовем общую процедуру проверки.
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок, Ложь, Истина);
		
	// Выполним более сложные проверки
	
	// Может быть проверять стоит, регистрировать точно не стоит, так как документ не используется
	//// Организация
	//Если Не ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "Организация", "Заполните реквизит по значению ""Company"" на вкладке ""Дополнительно""", Отказ, Истина, Заголовок);
	//КонецЕсли;
	//
	//// Подразделение организации, отказ не передается!
	//Если Не ЗначениеЗаполнено(СтруктураШапкиДокумента.ПодразделениеОрганизации) Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "ПодразделениеОрганизации", "Подставьте подразделение с кодом, указанным на вкладке ""Дополнительно""", , Истина, Заголовок);
	//КонецЕсли;
	//
	//// Контрагент
	//Если Не ЗначениеЗаполнено(СтруктураШапкиДокумента.Контрагент) Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "Контрагент", "Найдите или создайте контрагента по реквизитам ""Vendor"" или ""VendorName"" на вкладке ""Дополнительно""", Отказ, Истина, Заголовок);
	//КонецЕсли;
	//
	//// Cash code, отказ не передается!
	//Если Не ЗначениеЗаполнено(СтруктураШапкиДокумента.CashCode) Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "CashCode", "Подставьте cash code с кодом, указанным на вкладке ""Дополнительно""", , Истина, Заголовок);
	//КонецЕсли;	
	//	
	//// Ваучер
	//Если СокрЛП(СтруктураШапкиДокумента.Ваучер) = "" Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "Ваучер", , Отказ, Истина, Заголовок);
	//КонецЕсли;

	//// Номер Счета
	//Если СокрЛП(СтруктураШапкиДокумента.НомерСчета) = "" Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "НомерСчета", , Отказ, Истина, Заголовок);
	//КонецЕсли;
	//
	//// Бух. счет Lawson, отказ не передается!
	////Если Не ЗначениеЗаполнено(СтруктураШапкиДокумента.БухСчетLawson) Тогда
	////	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "БухСчетLawson", "Укажите счет, соответствующий счету Lawson, указанному на вкладке ""Дополнительно""", , Истина, Заголовок);
	////КонецЕсли;
	//
	//// Описание затрат
	//// ДУМАТЬ!!! НУЖЕН ЛИ КОМУ-ТО ЭТО РЕКВИЗИТ???
	////Если Не ЗначениеЗаполнено(СтруктураШапкиДокумента.ОписаниеЗатрат) Тогда
	////	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "ОписаниеЗатрат", "Для заполнения реквизита можно воспользоваться значением ""Akt of acceptance"" на вкладке ""Дополнительно""", Отказ, Истина, Заголовок);
	////КонецЕсли;
	//	
	//// Номер СФ
	//Если СокрЛП(СтруктураШапкиДокумента.НомерВходящейСФ) = "" Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "НомерВходящейСФ", , Отказ, Истина, Заголовок);
	//КонецЕсли;
	//
	//// Ставка НДС СФ
	//Если Не ЗначениеЗаполнено(СтруктураШапкиДокумента.СтавкаНДССФ) Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "СтавкаНДССФ", "Заполните реквизит по значению ""TaxCode"" на вкладке ""Дополнительно""", Отказ, Истина, Заголовок);
	//КонецЕсли;
	//
	//// СуммаНДССФ
	//Если НЕ ОбщегоНазначения.ЗначениеСуммаНДСЗаполнено(СтруктураШапкиДокумента.СтавкаНДССФ, СтруктураШапкиДокумента.СуммаНДССФРуб) Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "СуммаНДССФРуб", , Отказ, Истина, Заголовок);
	//КонецЕсли;
	//
	//// Проверим заполнение поля Номер прихода
	//Если СокрЛП(СтруктураШапкиДокумента.НомерПрихода) = "" Тогда
	//	УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВШапкеТипаНеЗаполнен(ЭтотОбъект, "НомерПрихода", , Отказ, Истина, Заголовок);
	//КонецЕсли;
		
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеТЧСостав(ТаблицаСостав, Отказ, Заголовок)
	
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Номенклатура");
	// ЧТО ЗДЕСЬ ДОЛЖНО БЫТЬ ЕЩЕ???
	
    ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Состав", СтруктураОбязательныхПолей, Отказ, Заголовок, , Ложь, Истина);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Движение по Взаиморасчеты с поставщиками
	Движение = Движения.ВзаиморасчетыСПоставщиками.Добавить();
	Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
	Движение.Период			= СтруктураШапкиДокумента.ДатаВходящейСФ; //Регистр не регламентный
	Движение.Контрагент		= СтруктураШапкиДокумента.Контрагент;
	Движение.Валюта			= мВалютаРегламентированногоУчета;
	Движение.CashCode		= СтруктураШапкиДокумента.CashCode;
	Движение.СтавкаНДС		= СтруктураШапкиДокумента.СтавкаНДССФ;
	Движение.НомерСчета		= СтруктураШапкиДокумента.НомерСчета;
    Движение.НомерДокумента	= СтруктураШапкиДокумента.НомерВходящейСФ;
    //Движение.Договор		= СтруктураШапкиДокумента.Договор;
	Движение.Сумма			= СтруктураШапкиДокумента.СуммаСФСНДСРуб;
	Движение.СуммаНДС		= СтруктураШапкиДокумента.СуммаНДССФРуб;
		
	// Движение по НДСПокупкиУпр - Получен Счет-фактура
	Движение = Движения.НДСПокупкиУпр.Добавить();
	Движение.Период 			= СтруктураШапкиДокумента.ДатаПроведения; //Была ДатаРегистрацииСФ;
	Движение.Событие 			= Перечисления.СобытияПоНДСПокупки.ПолученСчетФактура;
	Движение.Организация 		= СтруктураШапкиДокумента.Организация;
	Движение.НомерСчета 		= СтруктураШапкиДокумента.НомерСчета;
	Движение.НомерСФ 			= СтруктураШапкиДокумента.НомерВходящейСФ;
	Движение.ДатаСФ 			= СтруктураШапкиДокумента.ДатаВходящейСФ;
	Движение.Поставщик 			= СтруктураШапкиДокумента.Контрагент;
	Движение.Валюта				= СтруктураШапкиДокумента.ВалютаСФ;
	Движение.СтавкаНДС			= СтруктураШапкиДокумента.СтавкаНДССФ;
	Движение.Подразделение		= СтруктураШапкиДокумента.ПодразделениеОрганизации;
	Движение.БухСчет			= СтруктураШапкиДокумента.БухСчет1c;
	Движение.AU					= СтруктураШапкиДокумента.AU1C;
	Движение.CashCode			= СтруктураШапкиДокумента.CashCode;
	Движение.НомерВаучера		= СтруктураШапкиДокумента.Ваучер;
	Движение.НалоговыйПериод	= СтруктураШапкиДокумента.НалоговыйПериод;
	Движение.СуммаБезНДС    	= СтруктураШапкиДокумента.СуммаСФБезНДСРуб;
	Движение.НДС   				= СтруктураШапкиДокумента.СуммаНДССФРуб;
	
	// Движение по СчетаФактурыКонтрагентов
	Движение = Движения.СчетаФактурыКонтрагентов.Добавить();
	Движение.Период				= СтруктураШапкиДокумента.ДатаПроведения; //Было ДатаРегистрацииСФ;
	Движение.ДатаРегистрации	= СтруктураШапкиДокумента.ДатаПроведения;		
	Движение.Валюта				= СтруктураШапкиДокумента.ВалютаСФ;
	Движение.Контрагент			= СтруктураШапкиДокумента.Контрагент;
	Движение.ДатаСФ				= СтруктураШапкиДокумента.ДатаВходящейСФ;
	Движение.НомерСФ 			= СтруктураШапкиДокумента.НомерВходящейСФ;
	Движение.НомерСчета			= СтруктураШапкиДокумента.НомерСчета;
	Движение.НомерВаучера		= СтруктураШапкиДокумента.Ваучер;
	Движение.СтавкаНДС			= СтруктураШапкиДокумента.СтавкаНДССФ;
	Движение.БухСчет1С			= СтруктураШапкиДокумента.БухСчет1C;
	Движение.AU1С				= СтруктураШапкиДокумента.AU1C;
	//Движение.Причина			= СтруктураШапкиДокумента.Причина;
	Движение.ОписаниеЗатрат		= СтруктураШапкиДокумента.ОписаниеЗатрат;
	Движение.Сумма				= СтруктураШапкиДокумента.СуммаСФСНДС;
	Движение.СуммаРуб			= СтруктураШапкиДокумента.СуммаСФСНДСРуб;
		
	// Движение по НДСПокупкиУпр - Предъявлен НДС Поставщиком
	Движение = Движения.НДСПокупкиУпр.Добавить();
	Движение.Событие 			= Перечисления.СобытияПоНДСПокупки.ПредъявленНДСПоставщиком;
	Движение.Организация 		= СтруктураШапкиДокумента.Организация;
	Движение.Период 			= СтруктураШапкиДокумента.ДатаПроведения; //Было ДатаРегистрацииПрихода;
	Движение.НомерСчета 		= СтруктураШапкиДокумента.НомерСчета;
	Движение.НомерСФ 			= СтруктураШапкиДокумента.НомерВходящейСФ;
	Движение.ДатаСФ 			= СтруктураШапкиДокумента.ДатаВходящейСФ;
	Движение.Поставщик 			= СтруктураШапкиДокумента.Контрагент;
	Движение.Валюта				= СтруктураШапкиДокумента.ВалютаСФ;
	Движение.СтавкаНДС			= СтруктураШапкиДокумента.СтавкаНДССФ;
	Движение.Подразделение		= СтруктураШапкиДокумента.ПодразделениеОрганизации;
	Движение.БухСчет			= СтруктураШапкиДокумента.БухСчет1C;
	Движение.AU					= СтруктураШапкиДокумента.AU1C;
	Движение.CashCode			= СтруктураШапкиДокумента.CashCode;
	Движение.НомерВаучера		= СтруктураШапкиДокумента.Ваучер;
	Движение.НалоговыйПериод	= СтруктураШапкиДокумента.НалоговыйПериод;
	Движение.СуммаБезНДС    	= СтруктураШапкиДокумента.СуммаСФБезНДСРуб;
	Движение.НДС   				= СтруктураШапкиДокумента.СуммаНДССФРуб;
	
	// Движение по АктыКонтрагентов
	Движение=Движения.АктыКонтрагентов.Добавить();
	Движение.Период				= СтруктураШапкиДокумента.ДатаПроведения; // Было ДатаРегистрацииПрихода
	Движение.ДатаРегистрации	= СтруктураШапкиДокумента.ДатаПроведения;
	// Решено, что валюта прихода должна совпадать с валютой СФ
	//Движение.Валюта				= СтруктураШапкиДокумента.ВалютаПрихода;
	Движение.Валюта				= СтруктураШапкиДокумента.ВалютаСФ;
	Движение.Контрагент			= СтруктураШапкиДокумента.Контрагент;
	Движение.ДатаПрихода		= СтруктураШапкиДокумента.ДатаПрихода;
	Движение.НомерПрихода		= СтруктураШапкиДокумента.НомерПрихода;
	Движение.НомерСчета			= СтруктураШапкиДокумента.НомерСчета;
	Движение.НомерВаучера		= СтруктураШапкиДокумента.Ваучер;
	Движение.СтавкаНДС			= СтруктураШапкиДокумента.СтавкаНДССФ;
	// Решено, что сумма приода должна совпадать с суммой СФ
	//Движение.Сумма				= СтруктураШапкиДокумента.СуммаПрихода;
	//Движение.СуммаРуб			= СтруктураШапкиДокумента.СуммаПриходаРуб;
	// ЗДЕСЬ ТОЧНО С НДС???
	Движение.Сумма				= СтруктураШапкиДокумента.СуммаСФСНДС;
	Движение.СуммаРуб			= СтруктураШапкиДокумента.СуммаСФСНДСРуб;
		
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДОКУМЕНТА

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Сформируем таблицу Состав
	ТаблицаСостав = СформироватьТаблицуСостав();
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Проверим правильность заполнения ТЧ Состав
	ПроверитьЗаполнениеТЧСостав(ТаблицаСостав, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	
КонецПроцедуры


мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
УчетОшибокЗаполнения.ИнициализироватьСтруктуруДанныхОшибокЗаполнения(ЭтотОбъект);
